Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Given the experimental nature of this feature, we initially made it opt-in. To enable reflection-free Jackson serializers and deserializers in your Quarkus application, it is necessary to add the following configuration to your `application.properties` file:
ja_jp: この機能は実験的な性質であったため、当初はオプトイン方式にしていました。Quarkus アプリケーションでリフレクションなしの Jackson シリアライザーとデシリアライザーを有効にするには、`application.properties` ファイルに次の設定を追加する必要がありました。

source: Given the following declaration of a timer: `registry.timer("http.server.requests")`, applied naming conventions will emit the following metrics for different monitoring systems:
ja_jp: タイマーの `registry.timer("http.server.requests")` 宣言に基づいて、適用された命名規則により、さまざまな監視システム向けに以下のメトリクスが発行されます。

source: Given the preceding configuration, the request is authorized if the client certificate's CN attribute is equal to `alice` or `bob` and forbidden if it is equal to `jdoe`.
ja_jp: 上記の設定では、クライアント証明書の CN 属性が `alice` または `bob` の場合にリクエストが承認され、 `jdoe` の場合はリクエストが拒否されます。

source: Given the preceding permission set, `GET /api/foo` would match both permission sets' paths, requiring both the `user` and `admin` roles.
ja_jp: 上記の権限セットの場合、 `GET /api/foo` は両方の権限セットのパスにマッチするため、 `user` と `admin` の両方のロールが必要です。

source: Given the preceding permission set, `GET /public/foo` would match both the path and method and therefore be allowed. In contrast, `POST /public/foo` would match the path but not the method, and, therefore, be rejected.
ja_jp: 上記の権限セットが与えられている場合、 `GET/public/foo` はパスとメソッドの両方にマッチするため、許可されます。 対照的に、 `POST/public/foo` はパスにマッチしますが、メソッドにはマッチしないため、拒否されます。

source: Given the preceding permission set, `GET /public/forbidden-folder/foo` would match both permission sets' paths. However, because the longer path matches the path of the `deny1` permission set, `deny1` is chosen, and the request is rejected.
ja_jp: 上記の権限セットの場合、 `GET/public/forbidden-folder/foo` は両方の権限セットのパスとマッチします。 ただし、より長いパスが `deny1` 権限セットのパスとマッチするため、 `deny1` が選択され、リクエストは拒否されます。

source: Given the preceeding configuration, the request is authorized if the client certificate's CN attribute is equal to `alice` or `bob` and forbidden if it is equal to `jdoe`.
ja_jp: 上記の設定では、クライアント証明書の CN 属性が `alice` または `bob` の場合にリクエストが認可され、 `jdoe` の場合はリクエストが拒否されます。

source: Given the way Quarkus is architected, it was not as easy as it should be to generate test coverage reports with Jacoco.
ja_jp: Quarkusのアーキテクチャを考えると、Jacocoでテストカバレッジレポートを作成するのはそれほど簡単ではありませんでした。

source: Given there are a couple of CVEs in Maven 3.6, we upgraded the Maven version included in the generated projects to 3.8.1 (the one from the Maven wrapper).
ja_jp: Maven 3.6 にはいくつかの CVE が存在するため、生成されたプロジェクトに含まれる Maven のバージョンを 3.8.1 (Maven ラッパーのもの) にアップグレードしました。

source: Given this client was deprecated by Elastic and replaced by a new Open Source Java client, the Elasticsearch High Level REST Client extension is considered deprecated and will be removed from the Quarkus codebase at some point in the future.
ja_jp: このクライアントがElasticによって非推奨とされ、新しいオープンソースのJavaクライアントに置き換えられたことから、Elasticsearch 高レベルRESTクライアントのエクステンションは非推奨とされ、将来的にQuarkusのコードベースから削除される予定です。

source: Given this configuration, the `jwt` cookie will have a `SameSite=Lax` attribute and the `session` cookie will have a `SameSite=Strict` attribute.
ja_jp: この設定では、 `jwt` クッキーは `SameSite=Lax` 属性を持ち、 `session` クッキーは `SameSite=Strict` 属性を持つことになります。

source: Given this entity:
ja_jp: このエンティティーの場合:

source: Given this simple entity:
ja_jp: このシンプルなエンティティ:

source: Given this work is self contained, it was judged safe enough to be included in this release.
ja_jp: これは自己完結型であるため、今回のリリースに収録するには十分な安全性があると判断しました。

source: Given what was mentioned above about how the application needs to be launched in order for the archive to be built, the question arises of how Quarkus deals with this situation.
ja_jp: アーカイブをビルドするためにアプリケーションを起動する必要があることは前述しましたが、Quarkusはこの状況にどのように対処するのかという疑問が生じます。

source: Giving DBA privileges to the user
ja_jp: ユーザーへの DBA 権限付与

source: Giving Quarkus the database kind you are targeting will facilitate configuration. By using a JDBC driver extension and setting the kind in the configuration, Quarkus resolves the JDBC driver automatically, so you don't need to configure it yourself. If you want to use a database kind that is not part of the built-in ones, use `other` and define the JDBC driver explicitly.
ja_jp: 対象とするデータベースの種類を Quarkus に指定することで、設定が容易になります。JDBC ドライバーの拡張を使用して、設定でタイプを指定することで、Quarkus は自動的に JDBC ドライバーを解決します。そのため、自分で設定する必要はありません。組み込みのものに含まれていないデータベースの種類を使用したい場合は、 `other` を使用して、JDBCドライバーを明示的に定義してください。

source: Global Client Interceptor Example
ja_jp: グローバルクライアントインターセプターの例

source: Global State
ja_jp: グローバルな状態

source: Global Timeout
ja_jp: グローバルタイムアウト

source: Global Variables
ja_jp: グローバル変数

source: Global Variables Definition
ja_jp: グローバル変数の定義

source: Global channel attributes can be configured using the connector name:
ja_jp: グローバルチャネル属性は、コネクター名を使用して設定できます。

source: Global flag to disable Dev Services
ja_jp: Dev Servicesを無効にするグローバル・フラグ

source: Global proxy configuration
ja_jp: グローバルプロキシー設定

source: Global variables are:
ja_jp: グローバル変数は次のとおりです。

source: Global variables may conflict with regular data objects. <<typesafe_templates,Type-safe templates>> override the global variables automatically. For example, the following definition overrides the global variable supplied by the `Globals#user()` method:
ja_jp: グローバル変数は、通常のデータオブジェクトと競合する場合があります。<<typesafe_templates,タイプセーフテンプレート>> は、グローバル変数を自動的にオーバーライドします。たとえば、以下の定義は `Globals#user()` メソッドが提供するグローバル変数をオーバーライドします。

source: Global variables may conflict with regular data objects. xref:typesafe_templates[Type-safe templates] override the global variables automatically. For example, the following definition overrides the global variable supplied by the `Globals#user()` method:
ja_jp: グローバル変数は、通常のデータオブジェクトと衝突する可能性があります。 xref:typesafe_templates[タイプセーフ・テンプレート] は、グローバル変数を自動的にオーバーライドします。例えば、次の定義は、 `Globals#user()` メソッドが提供するグローバル変数をオーバーライドします:

source: Globally set the group id used for publication
ja_jp: 公開に使用するグループIDをグローバルに設定

source: Globally, by editing the `io.quarkus.analytics.localconfig` file in the '.redhat' folder of your user’s home directory. Update the file as follows:
ja_jp: グローバルでは、ユーザーのホームディレクトリの「.redhat」フォルダにある `io.quarkus.analytics.localconfig` ファイルを編集します。以下のようにファイルを更新してください：

source: Glossary
ja_jp: 用語集

source: Gmail specific configuration
ja_jp: Gmail特有の設定

source: Go ahead and add the new field to the `GreetingProperties` class:
ja_jp: `GreetingProperties` クラスに新しいフィールドを追加してください。

source: Go ahead and update this line to include the `quarkus-bom` and the `quarkus-rest` dependency like so:
ja_jp: 次のように、この行を更新して `quarkus-bom` と `quarkus-rest` の依存関係を含めます。

source: Go ahead and update this line to include the `quarkus-bom` and the `quarkus-resteasy-reactive` dependency like so:
ja_jp: この行を `quarkus-resteasy` の依存関係を含むように更新します。

source: Go ahead and update this line to include the `quarkus-resteasy` dependency like so:
ja_jp: この行を更新して、 `quarkus-resteasy` 依存関係を含むようにしてください。

source: Go back to http://localhost:8080/q/dev/, repeat the process of logging in to `Auth0` and check the ID token again, now you should see the ID token containing the `name` claim:
ja_jp: http://localhost:8080/q/dev/ に戻り、 `Auth0` へのログインプロセスを繰り返して ID トークンを再度確認すると、 `name` クレームを含む ID トークンが表示されるはずです。

source: Go back to the generated `org.acme.greeting.extension.deployment.GreetingExtensionProcessor` class.
ja_jp: 生成された `org.acme.quarkus.greeting.deployment.GreetingProcessor` クラスに戻ります。

source: Go code reads from its memory space, and evaluates the CEL expression using the Google CEL library
ja_jp: Go コードはそのメモリー空間から読み取り、Google CEL ライブラリーを使用して CEL 式を評価します。

source: Go more in depth into the Quarkus implementation of CDI.
ja_jp: CDIのQuarkus実装についてさらに詳しく説明します。

source: Go returns an integer result code (1=allow, 0=deny, negative=error)
ja_jp: Go は整数の結果コードを返します (1=許可、0=拒否、負の値=エラー)。

source: Go to `http://localhost:8080/coffee/2/availability` in your browser. You should see a number being returned.
ja_jp: ブラウザで `http://localhost:8080/coffee/2/availability` を開いて下さい。数字が返ってくるのが見えるでしょう。

source: Go to `http://localhost:8080` and follow the https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] tutorial to login to GitHub and get your GitHub account email(s) displayed.
ja_jp: `http://localhost:8080` にアクセスし、 https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルに従って GitHub にログインし、GitHub アカウントのメールアドレスが表示されることを確認してください。

source: Go to `http://localhost:8080`, login to GitHub and get your GitHub account email(s) displayed.
ja_jp: `http://localhost:8080` にアクセスし、GitHub にログインして、GitHub アカウントのメールアドレスが表示されることを確認してください。

source: Go to https://developer.apple.com/account/resources/identifiers/list[Create a new identifier] and press `+`
ja_jp: https://developer.apple.com/account/resources/identifiers/list[Create a new identifier] にアクセスして `+` を押します

source: Go to the Auth0 dashboard and create a regular web application. For example, create an Auth0 application called `QuarkusAuth0`.
ja_jp: Auth0 ダッシュボードに移動し、通常の Web アプリケーションを作成します。 例えば、 `QuarkusAuth0` という Auth0 アプリケーションを作成します。

source: Go to the Auth0 dashboard, add an `echo:name` permission to the `QuarkusAuth0API` API:
ja_jp: Auth0 ダッシュボードに移動し、 `QuarkusAuth0API` API に `echo:name` 権限を追加します。

source: Go to the `src/main/asciidoc/_templates` directory, and make a copy of the relevant template for the content type you have chosen. Be sure to:
ja_jp: `src/main/asciidoc/_templates` ディレクトリに移動し、選択したコンテンツタイプに対応するテンプレートのコピーを作成します。必ず、以下のようにしてください:

source: Go to the https://developer.apple.com/account/resources/authkeys/list[Keys] page on the left menu, and press `+`:
ja_jp: 左側のメニューの https://developer.apple.com/account/resources/authkeys/list[Keys] ページに移動し、 `+` を押します。

source: Go to the project directory and update the project to the latest stream:
ja_jp: プロジェクト・ディレクトリに移動し、プロジェクトを最新のストリームに更新します：

source: Goal-oriented and use the language and keywords of the audience
ja_jp: 目標志向で、聴衆の言葉やキーワードを利用する

source: Going Further
ja_jp: さらに詳しく

source: Going back to the original question, we wanted to find out why a given code path gets included. One way to do it is to start by the method itself, and then walk backwards to find what links (e.g. direct calls, virtual calls, overrides...etc) exist to that method within a certain depth. For example, let's try to find what other methods have a direct link to the `persist` method:
ja_jp: 最初の質問に戻りますが、私たちはあるコードパスがなぜ含まれるのかを知りたいと思いました。一つの方法は、メソッド自体から始めて、ある深さの範囲内でそのメソッドにどのようなリンク（例えば、直接呼び出し、仮想呼び出し、オーバーライド...など）が存在するかを逆に探すことです。例えば、 `persist` のメソッドに直接リンクしている他のメソッドを探してみましょう。

source: Going further
ja_jp: さらに詳しく

source: Going further with an endpoint returning JSON
ja_jp: JSONを返すエンドポイントでその先へ

source: Going native
ja_jp: ネイティブ化

source: Gone are the days of a thousand configuration files and formats. A single configuration file is all it takes for Quarkus applications to configure every single extension.
ja_jp: 1000もの設定ファイルやフォーマットがあった時代は終わりです。1つの設定ファイルがあれば、Quarkusのアプリケーションはすべてのエクステンションを設定することができます。

source: Good concept guides:
ja_jp: 優れたコンセプトガイド:

source: Good example
ja_jp: 良い例

source: Good how-to guides:
ja_jp: 優れたハウツーガイド:

source: Good news for Java developers in Switzerland and beyond. Abraxas is hiring and looking to bring on new team members who are open-minded and not afraid to actively participate. Abraxas encourages its developers to spend time looking at other technologies. If you live in Switzerland or are considering moving there, have a look at their https://www.abraxas.ch/de/karriere/offenen-stellen[job offerings].
ja_jp: スイスやその他の国のJava開発者に朗報です。Abraxasでは、オープンマインドで積極的に参加することを恐れない新しいチームメンバーを採用したいと考えています。Abraxasは、開発者が他の技術に目を向けることに時間を費やすことを奨励しています。スイスにお住まいの方、またはスイスへの移住を検討されている方は、同社の link:https://www.abraxas.ch/de/karriere/offenen-stellen[求人情報]をご覧になってみてください。

source: Good reference guides:
ja_jp: 優れたリファレンスガイド:

source: Good tutorials:
ja_jp: 優れたチュートリアル:

source: Google Cloud Blog:
ja_jp: Google Cloud ブログ:

source: Google Cloud Functions (Serverless)
ja_jp: Google Cloud Functions (サーバーレス)

source: Google Cloud Functions (Serverless) with Quarkus REST, Undertow, or Reactive Routes
ja_jp: Quarkus REST、Undertow、またはReactive Routesを使用したGoogle Cloud Functions（サーバーレス）

source: Google Cloud Functions (Serverless) with RESTEasy Reactive, Undertow, or Reactive Routes
ja_jp: Google Cloud Functions (Serverless) with RESTEasy, Undertow, or Reactive Routes

source: Google Cloud Functions (Serverless) with RESTEasy, Undertow, or Reactive Routes
ja_jp: Google Cloud Functions (Serverless) with RESTEasy, Undertow, あるいは Reactive Routes

source: Google Cloud Functions with Vert.x Web, Servlet, or RESTEasy
ja_jp: Vert.x Web、Servlet、または RESTEasy を使用した Google Cloud Function

source: Google Cloud Run allows you to run your Docker containers inside Google Cloud Platform in a managed way.
ja_jp: Google Cloud Runでは、Google Cloud Platform内でDockerコンテナーをマネージドな方法で実行することができます。

source: Google Cloud SQL provides managed instances for MySQL, PostgreSQL and Microsoft SQL Server. Quarkus has support for all three databases.
ja_jp: Google Cloud SQLは、MySQL、PostgreSQL、Microsoft SQL Serverのマネージドインスタンスを提供します。Quarkusはこの3つのデータベースをサポートしています。

source: Google Cloud requires the `trace` field to follow the `"projects/<my-trace-project>/traces/12345"` format. `<my-trace-project>` uses the value of the `quarkus.application.name` configuration property.
ja_jp: Google Cloud では、`trace` フィールドが `"projects/<my-trace-project>/traces/12345"` フォーマットである必要があります。`<my-trace-project>` には `quarkus.application.name` 設定プロパティーの値が使用されます。

source: Google OpenID Provider Configuration
ja_jp: Google OpenID プロバイダーの設定

source: Got a `ContextNotActiveException`?
ja_jp: `ContextNotActiveException` が発生しましたか?

source: GraalVM (Java 11) installed with `JAVA_HOME` and `GRAALVM_HOME` configured appropriately
ja_jp: GraalVM (Java 11) をインストールし、 `JAVA_HOME` と `GRAALVM_HOME` を適切に設定しました。

source: GraalVM 20.2 in its Java 11 flavor is still the recommended GraalVM version.
ja_jp: Java 11 対応の GraalVM 20.2 は、まだ推奨の GraalVM のバージョンです。

source: GraalVM 20.2 in its Java 11 flavor is the recommended GraalVM version.
ja_jp: Java 11に対応したGraalVM 20.2が推奨バージョンです。

source: GraalVM 20.3 in its Java 11 flavor is the newly recommended GraalVM version.
ja_jp: Java 11のフレーバーのGraalVM 20.3は、新たに推奨されているバージョンです。

source: GraalVM 21.1 is the recommended version for Quarkus 2.0.
ja_jp: GraalVM 21.1は、Quarkus 2.0の推奨バージョンです。

source: GraalVM 21.3.0 introduces the possibility of representing call trees as CSV files instead of a single text file. These CSV files contain method information and different connections between them (e.g. direct calls, virtual calls, overrides, etc). One immediate benefit is that there's no information duplication, so the CSV files can be several times smaller in size compared to the corresponding text file. In some situations, they can be as much as several thousands times smaller. However, the main reason why this feature was implemented was to make it easier to feed the call tree to other tools, like graph databases such as https://neo4j.com/[Neo4j]. Once imported, a user can execute graph queries over the call tree, which makes it easier to extract relevant information and answer questions like the one above.
ja_jp: GraalVM 21.3.0では、コールツリーを単一のテキストファイルではなく、CSVファイルで表現することができるようになりました。これらのCSVファイルには、メソッド情報とメソッド間のさまざまな接続（直接呼び出し、仮想呼び出し、オーバーライドなど）が含まれています。直接的な利点としては、情報の重複がないため、CSVファイルのサイズは対応するテキストファイルに比べて数倍小さくなります。場合によっては、数千倍小さくなることもあります。しかし、この機能が実装された主な理由は、コールツリーを link:https://neo4j.com/[Neo4j]のようなグラフデータベースなどの他のツールに簡単に提供できるようにするためです。インポートされると、ユーザーはコールツリー上でグラフクエリを実行することができ、関連する情報を抽出して上記のような質問に答えることが容易になります。

source: GraalVM CE 21.3 and Mandrel 21.3
ja_jp: GraalVM CE 21.3およびMandrel 21.3

source: GraalVM CE 22.3 and Mandrel 22.3
ja_jp: GraalVM CE 22.3およびMandrel 22.3

source: GraalVM CE for JDK 17/20 and Mandrel 23.0
ja_jp: JDK 17/20 および Mandrel 23.0 向け GraalVM CE

source: GraalVM CE for JDK 23 and Mandrel 24.1
ja_jp: JDK 23 および Mandrel 24.1 用の GraalVM CE

source: GraalVM CE for JDK 24 Mandrel 24.2
ja_jp: JDK 24 用 GraalVM CE / Mandrel 24.2

source: GraalVM Native Executable support has been an essential part of the design for Quarkus from the beginning. When an application is compiled down to a native executable, it starts much faster and can run with a much smaller heap than a standard JVM. The native compiler uses aggressive dead-code elimination techniques to only embed the parts of the JVM and classes that are absolutely required by your application. Quarkus makes building optimized native executables plain easy. The build-time approach allows Quarkus to collect enough metadata on your application to fine-tune the compilation. No <code>-H:+ReportUnsupportedElementsAtRuntime</code> flag, no fallback, no compromise!
ja_jp: GraalVM ネイティブ実行可能ファイルのサポートは、当初から Quarkus の設計の不可欠な要素でした。アプリケーションがネイティブ実行可能ファイルにコンパイルされると、標準的な JVM よりもはるかに高速に起動し、はるかに小さなヒープで実行できます。ネイティブコンパイラーは、積極的なデッドコード排除技術を使用して、アプリケーションで絶対に必要な JVM およびクラスの部分のみを埋め込みます。Quarkus は、最適化されたネイティブ実行可能ファイルのビルドを簡単にします。ビルド時のアプローチにより、Quarkus はアプリケーションに関する十分なメタデータを収集し、コンパイルを微調整できます。 ` -H:+ReportUnsupportedElementsAtRuntime ` フラグもフォールバックも妥協もありません。

source: GraalVM Version
ja_jp: GraalVMバージョン

source: GraalVM and the popularization of AOT in Java
ja_jp: GraalVM と Java における AOT の普及

source: GraalVM binaries are not (yet) notarized for macOS Catalina as reported in this https://github.com/oracle/graal/issues/1724[GraalVM issue]. This means that you may see the following error when using `gu`:
ja_jp: この https://github.com/oracle/graal/issues/1724[GraalVMの問題]で報告されているように、GraalVMバイナリーは(まだ)macOS Catalinaに対して認証されていません。これは、 `gu` 使用時に次のエラーが表示される可能性があることを意味します:

source: GraalVM binaries are not (yet) notarized for macOS as reported in this https://github.com/oracle/graal/issues/1724[GraalVM issue]. This means that you may see the following error when using `native-image`:
ja_jp: この https://github.com/oracle/graal/issues/1724[GraalVM の issue] で報告されているように、GraalVM のバイナリーは macOS 用に (まだ) 公証されていません。そのため、`native-image` を使用した際に以下のエラーが表示されることがあります。

source: GraalVM imposes a number of constraints and making your application a native executable might require a few tweaks.
ja_jp: GraalVM は多くの制約を課しており、アプリケーションをネイティブ実行可能なものにするには、いくつかの調整が必要になるかもしれません。

source: GraalVM installed with `JAVA_HOME` and `GRAALVM_HOME` configured appropriately
ja_jp: GraalVMがインストールされ、 `JAVA_HOME` と `GRAALVM_HOME` が適切に設定されていること

source: GraalVM native image:: preferred term for the VM creating native executable. No space.
ja_jp: GraalVM native image:: ネイティブ実行可能ファイルを作成するためのVMを表す好ましい用語。スペースなし

source: GraalVM supports both build time and runtime certificate configuration.
ja_jp: GraalVMは、ビルド時と実行時の両方の証明書設定をサポートしています。

source: GraalVM version
ja_jp: GraalVMバージョン

source: GraalVM versions can have different paths for these files whether you are using the Java 8 or 11 version. Adjust accordingly.
ja_jp: GraalVM のバージョンは、使用しているバージョンが Java 8 か 11 かによりファイルへのパスが異なるため、適宜調整してください。

source: GraalVM versions can have different paths for these files, and whether you using the Java 8 or 11 version. Adjust accordingly.
ja_jp: Java 8 か 11 バージョンのいずれか、GraalVM バージョンによって、これらのファイルのパスが異なる場合があります。それに応じて調整してください。

source: GraalVM {graalvm-version} is required.
ja_jp: GraalVM {graalvm-version} が必要です。

source: GraalVM's Serial GC implementation offers a choice between two different collection policies, the default is called "adaptive" and the alternative is called "space/time".
ja_jp: GraalVMのシリアルGC実装は、2つの異なる収集ポリシー間の選択を提供します。デフォルトは "adaptive" と呼ばれ、代替は "space/time"と呼ばれます。

source: GraalVM/Mandrel 21.3 is the recommended version for Quarkus 2.5.
ja_jp: GraalVM/Mandrel 21.3が、Quarkus 2.5における推奨バージョンです。

source: GraalVM/Mandrel upgrade coming soon
ja_jp: GraalVM/Mandrelのアップグレードが間近に迫っています。

source: Grab a coffee or tea, as it may take a few minutes
ja_jp: 数分かかる場合がありますので、コーヒーや紅茶を淹れましょう

source: Graceful Shutdown
ja_jp: グレースフルシャットダウン

source: Graceful shutdown
ja_jp: 優雅なシャットダウン

source: Gradle Dependency SBOMs
ja_jp: Gradle 依存関係 SBOM

source: Gradle Plugin Repositories
ja_jp: Gradle プラグインリポジトリー

source: Gradle build
ja_jp: Gradle ビルド

source: Gradle caching / task inputs
ja_jp: Gradle キャッシング / タスク入力

source: Gradle configuration cache
ja_jp: Gradle設定キャッシュ

source: Gradle creating a production application
ja_jp: Gradle による本番アプリケーションの作成

source: Gradle default value: `$buildDir/classes/java/quarkus-generated-sources/grpc`
ja_jp: Gradle のデフォルト値: `$buildDir/classes/java/quarkus-generated-sources/grpc`

source: Gradle dev mode
ja_jp: Gradle の開発モード

source: Gradle is a bit quirky with process management, so you need the `--no-daemon` switch or control-c will not destroy the process cleanly and you'll have open ports.
ja_jp: Gradle はプロセス管理に少しクセがあるため、`--no-daemon` スイッチが必要です。そうしないと、 control-c でプロセスが正常に破棄されず、ポートが開いたままになることがあります。

source: Gradle is a bit quirky with process management, so you need the `--no-daemon` switch, or control-c will not destroy the process cleanly, and you'll have open ports.
ja_jp: Gradle はプロセス管理に少し癖があるため、`--no-daemon` スイッチが必要です。そうしないと、Control-C でプロセスが正常に破棄されず、開いたポートが残ってしまいます。

source: Gradle setup
ja_jp: Gradle のセットアップ

source: Gradle users will have to explicitly configure a publishing plugin to deploy SBOMs as Maven artifacts.
ja_jp: Gradle ユーザーが SBOM を Maven アーティファクトとしてデプロイする場合は、公開プラグインを明示的に設定する必要があります。

source: Grafana OTel LGTM option
ja_jp: Grafana OTel LGTM オプション

source: Grafana UI access
ja_jp: Grafana UI へのアクセス

source: Grafana is used to visualize data, Loki to store logs, Tempo to store traces and Prometheus to store metrics. Also provides and OTel collector to receive the data.
ja_jp: Grafana はデータの可視化、Loki はログの保存、Tempo はトレースの保存、Prometheus はメトリクスの保存に使用されます。データを受信するための OTel コレクターも提供されます。

source: Grafana-OTel-LGTM Dev Service
ja_jp: Grafana-OTel-LGTM 開発サービス

source: Grant scopes
ja_jp: グラントスコープ

source: Granted, it doesn't read the entire JAR, each archive has an index, but still.
ja_jp: 確かに JAR 全体を読み取るわけではなく、各アーカイブにはインデックスがありますが、それでもコストはかかります。

source: Granted, it's a simple REST application with a single endpoint, but it still relies on a full-featured REST implementation. And it runs in the JVM.
ja_jp: 確かに、単一のエンドポイントを持つシンプルな REST アプリケーションですが、それでもフル機能の REST 実装に依存しています。そして、JVM で動作します。

source: Grants the permission `media-library`, which permits `read`, `write`, and `list` actions. Because `MediaLibrary` is the `TvLibrary` class parent, a user with the `admin` role is also permitted to modify `TvLibrary`.
ja_jp: `media-library` 権限を付与します。これにより、 `read`、 `write`、および `list` アクションが許可されます。 `MediaLibrary` は `TvLibrary` クラスの親であるため、 `admin` ロールを持つユーザーも `TvLibrary` を変更することが許可されます。

source: Granularity of the ack-timeout redelivery. + Using an higher `tickDurationMillis` reduces the memory overhead to track messages when setting ack-timeout to a bigger value (for example, 1 hour).
ja_jp: ack-timeout 再配信の粒度。 `tickDurationMillis` を大きくすることで、ack-timeout を大きな値 (たとえば 1 時間) に設定したときにメッセージを追跡するためのメモリ・オーバーヘッドを減らすことができます。

source: GraphQL UI is a great tool permitting easy interaction with your GraphQL APIs.
ja_jp: GraphQL UIは、GraphQL APIとの簡単なやり取りを可能にする素晴らしいツールです。

source: GraphQL client integration
ja_jp: GraphQL クライアントインテグレーション

source: GraphQL client types introduction
ja_jp: GraphQLクライアントタイプの紹介

source: GraphQL endpoints singleton
ja_jp: GraphQLエンドポイントシングルトン
